app/controllers/menu_items_controller.rb

INSERT INTO "menu_items" ("created_at", "menu_item", "updated_at") VALUES (?, ?, ?)  [["created_at", "2017-05-18 08:47:37.266136"], ["menu_item", ""], ["updated_at", "2017-05-18 08:47:37.266136"]]
---
  def create
    @menu_item = MenuItem.new(menu_item_params)
    @menu_item.save

SELECT "menu_items".* FROM "menu_items"
---
  def index
    @menu_items = MenuItem.all

DELETE FROM "menu_items" WHERE "menu_items"."id" = ?  [["id", 1]]
---
  def destroy
    @menu_item.destroy

SELECT  "menu_items".* FROM "menu_items"  WHERE "menu_items"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_menu_item
      @menu_item = MenuItem.find(params[:id])