app/controllers/resumes_controller.rb

INSERT INTO "resumes" ("attachment", "created_at", "name", "updated_at") VALUES (?, ?, ?, ?)  [["attachment", "animebanner1.png"], ["created_at", "2017-05-09 12:16:26.707956"], ["name", "aaaaaa"], ["updated_at", "2017-05-09 12:16:26.707956"]]
---
  def create
    @resume = Resume.new(resume_params)

    if @resume.save

SELECT  "resumes".* FROM "resumes"  WHERE "resumes"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "resumes" WHERE "resumes"."id" = ?  [["id", 1]]
---
  def destroy
    @resume = Resume.find(params[:id])
    @resume.destroy